# Werkcollege-opdrachten Week 1.3

## Dependencies importeren

Kopieer in het codeblok hieronder van het vorige werkcollege de import-code voor de dependencies die het vaakst worden gebruikt om data in te lezen. Geef er ook de gebruikelijke aliassen aan.<br>
Zet eventuele warnings uit.

In [2]:
import pandas as pd
import sqlite3
import warnings
import numpy as np
warnings.simplefilter('ignore')

Zet de volgende bestanden in een makkelijk te vinden map, als je dat nog niet gedaan hebt:
- go_sales.sqlite
- go_crm.sqlite
- go_staff.sqlite

## Databasetabellen inlezen

Kopieer in het codeblok hieronder van het vorige werkcollege de code om een connectie met het bestand go_sales.sqlite te maken.

In [3]:
conn = sqlite3.connect('go_sales.sqlite')

Lees van de ingelezen go_sales-database te volgende tabellen in met behulp van "SELECT * FROM *tabel*".
- product
- product_type
- product_line
- sales_staff
- sales_branch
- retailer_site
- country
- order_header
- order_details
- returned_item
- return_reason

In [4]:
products = pd.read_sql_query("SELECT * FROM product", conn)
product_types = pd.read_sql_query("SELECT * FROM product_type", conn)
product_lines = pd.read_sql_query("SELECT * FROM product_line", conn)
sales_staffs = pd.read_sql_query("SELECT * FROM sales_staff", conn)
sales_branches = pd.read_sql_query("SELECT * FROM sales_branch", conn)
retailer_sites = pd.read_sql_query("SELECT * FROM retailer_site", conn)
countries = pd.read_sql_query("SELECT * FROM country", conn)
order_headers = pd.read_sql_query("SELECT * FROM order_header", conn)
order_details =pd.read_sql_query("SELECT * FROM order_details", conn)
returned_items = pd.read_sql_query("SELECT * FROM returned_item", conn)
return_reasons = pd.read_sql_query("SELECT * FROM return_reason", conn)

Krijg je een "no such table" error? Dan heb je misschien met .connect() per ongeluk een leeg  databasebestand (.sqlite) aangemaakt.<br> <u>Let op:</u> lees eventueel de informatie uit het vorige werkcollege nog eens goed door.

Als je tijdens onderstaande opdrachten uit het oog verliest welke tabellen er allemaal zijn, kan je deze Pythoncode uitvoeren:

In [5]:
sql_query = "SELECT * FROM sqlite_master WHERE type='table';"
#Vul dit codeblok verder in
countries
#Op de puntjes hoort de connectie naar go_sales óf go_staff óf go_crm te staan.

    COUNTRY_CODE         COUNTRY LANGUAGE CURRENCY_NAME
0              1          France       EN        francs
1              2         Germany       EN         marks
2              3   United States       EN       dollars
3              4          Canada       EN       dollars
4              5         Austria       EN    schillings
5              6           Italy       EN          lira
6              7     Netherlands       EN      guilders
7              8     Switzerland       EN        francs
8              9  United Kingdom       EN        pounds
9             10          Sweden       EN         krona
10            11           Japan       EN           yen
11            12          Taiwan       EN    new dollar
12            13           Korea       EN           won
13            14           China       EN      renminbi
14            16       Australia       EN       dollars
15            17         Belgium       EN        francs
16            18         Denmark       EN        kroner
17            19           Spain       EN       pesetas
18            20          Mexico       EN         pesos
19            21          Brazil       EN         reals
20            22         Finland       EN        markka

Let op! Voor alle onderstaande opdrachten mag je <u>alleen Python</u> gebruiken, <u>geen SQL!</u>

## Selecties op één tabel zonder functies

Geef een overzicht met daarin de producten en hun productiekosten waarvan de productiekosten lager dan 100 dollar en hoger dan 50 dollar ligt. (2 kolommen, 23 rijen)

In [6]:
productCostFilteredAbove = products['PRODUCTION_COST'] < 100
productCostFilteredBelow = products['PRODUCTION_COST'] > 50
products.loc[(productCostFilteredAbove & productCostFilteredBelow), ['PRODUCT_NUMBER', 'PRODUCTION_COST' ]]

     PRODUCT_NUMBER  PRODUCTION_COST
5                 6            85.11
7                 8            75.00
16               17            60.00
17               18            86.00
19               20            78.55
22               23            65.33
23               24            62.50
45               46            52.86
47               48            55.00
57               58            57.13
68               69            73.33
69               70            80.00
70               71            60.00
71               72            72.50
74               75            80.00
77               78            79.19
78               79            92.58
79               80            94.12
82               83            56.25
83               84            78.55
109             110            60.00
110             111            81.80
113             114            80.00

Geef een overzicht met daarin de producten en hun marge waarvan de marge lager dan 20 % of hoger dan 60 % ligt. (2 kolommen, 7 rijen)

In [7]:
productCostFilteredAbove = products['MARGIN'] < 0.20
productCostFilteredBelow = products['MARGIN'] > 0.60
products.loc[(productCostFilteredAbove | productCostFilteredBelow), ['PRODUCT_NUMBER', 'MARGIN' ]]

    PRODUCT_NUMBER  MARGIN
20              21    0.17
23              24    0.17
85              86    0.67
86              87    0.67
87              88    0.70
88              89    0.63
89              90    0.63

Geef een overzicht met daarin de landen waar met francs wordt betaald. Sorteer de uitkomst op land.  (1 kolom, 3 rijen)

In [8]:
francCountries = countries['CURRENCY_NAME'].str.contains('francs')
countries.loc[(francCountries), :]

    COUNTRY_CODE      COUNTRY LANGUAGE CURRENCY_NAME
0              1       France       EN        francs
7              8  Switzerland       EN        francs
15            17      Belgium       EN        francs

Geef een overzicht met daarin de verschillende introductiedatums waarop producten met meer dan 50% marge worden geïntroduceerd (1 kolom, 7 rijen)

In [9]:

productDatumMargeFilter = products['MARGIN'] > 0.50
products.loc[(productDatumMargeFilter), 'INTRODUCTION_DATE'].drop_duplicates()

66     2000-10-26
85     1995-02-15
101    2003-12-10
103    2003-12-18
104    2003-12-27
106    2004-01-13
110    2003-12-15
Name: INTRODUCTION_DATE, dtype: str

Geef een overzicht met daarin het eerste adres en de stad van verkoopafdelingen waarvan zowel het tweede adres als de regio bekend is (2 kolommen, 7 rijen)

In [10]:
filterSalesBranch1 = sales_branches['ADDRESS2'].notna()
filterSalesBranch2 = sales_branches['REGION'].notna()
sales_branches.loc[(filterSalesBranch1 &filterSalesBranch2), ['ADDRESS1', 'CITY']]

                            ADDRESS1              CITY
2                Singelgravenplein 4         Amsterdam
13  Prol. Paseo de la Reforma No. 51  Distrito Federal
14               202-2-3 Hyakunincho             Tokyo
15                     543-225 Asahi        Osaka City
16                  2315 Queen's Ave         Melbourne
18             Avenida Paulista, 333         São Paulo
24                    3 Albany Court        Birmingham

Geef een overzicht met daarin de landen waar met dollars (dollars of new dollar) wordt betaald. Sorteer de uitkomst op land. (1 kolom, 4 rijen)

In [11]:
dollarCountries = countries['CURRENCY_NAME'].str.contains('dollar')
countries.loc[(dollarCountries), :].sort_values('COUNTRY')

    COUNTRY_CODE        COUNTRY LANGUAGE CURRENCY_NAME
14            16      Australia       EN       dollars
3              4         Canada       EN       dollars
11            12         Taiwan       EN    new dollar
2              3  United States       EN       dollars

Geef een overzicht met daarin beide adressen en de stad van vestigingen van klanten waarvan de postcode begint met een ‘D’ (van duitsland). Filter op vestigingen die een tweede adres hebben. (3 kolommen, 2 rijen)

In [12]:
germanRetailers = retailer_sites['POSTAL_ZONE'].str[0] == 'D'
address2Retailers = retailer_sites['ADDRESS2'].notna()
retailer_sites.loc[(germanRetailers & address2Retailers), ['ADDRESS1', 'ADDRESS2', 'CITY']]

            ADDRESS1       ADDRESS2       CITY
31  Röntgenstraße 90  3. Tür rechts  Frankfurt
59   Grubesallee 141       4. Stock    Hamburg

## Selecties op één tabel met functies

Geef het totaal aantal producten dat is teruggebracht (1 waarde)

In [13]:
returned_items['RETURN_CODE'].nunique()

619

Geef het aantal regio’s waarin verkoopafdelingen gevestigd zijn. (1 waarde)

In [14]:
sales_branches['REGION'].nunique()

15

Maak 3 variabelen:
- Een met de laagste
- Een met de hoogste
- Een met de gemiddelde (afgerond op 2 decimalen)

marge van producten (3 kolommen, 1 rij)

In [15]:
products[['MARGIN']].agg([max, min,np.mean]).round(2)

      MARGIN
max     0.70
min     0.17
mean    0.40

Geef het aantal vestigingen van klanten waarvan het 2e adres niet bekend is (1 waarde)

In [16]:
retailer_sites.loc[(retailer_sites['ADDRESS2'].isna()), :]['RETAILER_SITE_CODE'].nunique()

286

Geef de gemiddelde kostprijs van de verkochte producten waarop korting (unit_sale_price < unit_price) is verleend (1 waarde)

In [17]:
order_detailsMetKorting = order_details['UNIT_SALE_PRICE'] < order_details['UNIT_PRICE']
order_details.loc[(order_detailsMetKorting), ['UNIT_COST']].agg(np.mean)

UNIT_COST    127.340879
dtype: float64

Geef een overzicht met daarin het aantal medewerkers per medewerkersfunctie (2 kolommen, 7 rijen)

In [18]:
sales_staffs.groupby('POSITION_EN')['SALES_STAFF_CODE'].count()

POSITION_EN
Branch Manager                  19
District Manager                 4
General Manager                  1
Level 1 Sales Representative    13
Level 2 Sales Representative    39
Level 3 Sales Representative    24
Regional Manager                 2
Name: SALES_STAFF_CODE, dtype: int64

Geef een overzicht met daarin per telefoonnummer het aantal medewerkers dat op dat telefoonnummer bereikbaar is. Toon alleen de telefoonnummer waarop meer dan 4 medewerkers bereikbaar zijn. (2 kolommen, 10 rijen)

In [19]:
salesStaffPhoneFilter = sales_staffs.groupby('WORK_PHONE')['WORK_PHONE'].count() > 4


salesStaffPhoneFilter.loc[salesStaffPhoneFilter]

WORK_PHONE
+(44) 121 3505267      True
+(61) 03 2982  4242    True
+31 (0)20 692 93 94    True
+33 1 68 94 52 20      True
1 (206) 292-0012       True
1 (305) 557-4810       True
1 (310) 281-5722       True
1 (403) 232-5986       True
1 (416) 493-5595       True
1 (617) 268-6754       True
Name: WORK_PHONE, dtype: bool

## Selecties op meerdere tabellen zonder functies

Geef een overzicht met daarin het eerste adres en de stad van vestigingen van klanten uit ‘Netherlands’ (2 kolommen, 20 rijen)

In [20]:
countriesAndRetailers = pd.merge(countries, retailer_sites, left_on= 'COUNTRY_CODE', how= 'inner', right_on='COUNTRY_CODE')
netherlandRetailersFilter = countriesAndRetailers['COUNTRY'] == 'Netherlands'
countriesAndRetailers.loc[(netherlandRetailersFilter), ['ADDRESS1', 'CITY']]

                      ADDRESS1          CITY
215                   Beets 36         Beets
216               Perestraat 1      Deventer
217  Laan van Meerdervoort 966      Den Haag
218             Kalfjeslaan 47    Amstelveen
219               Startbaan 11    Amstelveen
220      Noorderspoorsingel 28     Groningen
221              Hogehilweg 13     Amsterdam
222             Spoorstraat 43    Varsseveld
223             Westhavenweg 8     Amsterdam
224              Westzeedijk 4        Muiden
225            Gooiergracht 91         Laren
226            Hoofdstraat 150   Pieterburen
227                Olde Diek 2         Laren
228     Amsterdamsestraatweg 8      Maarssen
229        Krayenhoffstraat 11     Amsterdam
230         Overschiestraat 19     Amsterdam
231              Havenbuurt 12        Marken
232               Duivendaal 1    Wageningen
233              Voorstraat 37  Nieuweschans
234         Stadhouderslaan 18     Rotterdam

Geef een overzicht met daarin de productnamen die tot het producttype ‘Eyewear’ behoren. (1 kolom, 5 rijen)

In [21]:
productCodeProducts = pd.merge(product_types, products, left_on= 'PRODUCT_TYPE_CODE', how= 'inner', right_on='PRODUCT_TYPE_CODE')
eyewearProductsFilter = productCodeProducts['PRODUCT_TYPE_EN'] == 'Eyewear'
productCodeProducts.loc[(eyewearProductsFilter), 'PRODUCT_NAME']

67        Polar Sun
68        Polar Ice
69     Polar Sports
70       Polar Wave
71    Polar Extreme
Name: PRODUCT_NAME, dtype: str

Geef een overzicht met daarin alle unieke eerste adressen van klantvestigingen en de voornaam en achternaam van de verkopers die ‘Branch Manager’ zijn en aan deze vestigingen hebben verkocht (3 kolommen, 1 rij)

In [22]:
merge1 = pd.merge(order_headers, retailer_sites, how= 'inner')
merge2 = pd.merge(merge1, sales_staffs, how='inner')
branchManagers = (merge2['POSITION_EN'] == 'Branch Manager')
merge2.loc[(branchManagers), ['ADDRESS1', 'FIRST_NAME', 'LAST_NAME']].drop_duplicates('ADDRESS1')

                  ADDRESS1 FIRST_NAME LAST_NAME
3185  Alameda Santos, 9876     Bayard     Lopes

Geef een overzicht met daarin van de verkopers hun functie en indien zij iets hebben verkocht de datum waarop de verkoop heeft plaatsgevonden. Laat alleen de verschillende namen van de posities zien van de verkopers die het woord ‘Manager’ in hun positienaam hebben staan. (2 kolommen, 7 rijen)

In [23]:
#merge3 = pd.merge(order_headers, sales_staffs, how= 'right')
#merge3Filter = merge3['POSITION_EN'].str.contains('Manager') 
#merge3.loc[(merge3Filter), :]

merge3 = pd.merge(order_headers, sales_staffs, how="inner", on="SALES_STAFF_CODE")
manager_rows = merge3["POSITION_EN"].str.contains("Manager")

result = (
    merge3.loc[manager_rows, ["POSITION_EN", "ORDER_DATE"]]
    .drop_duplicates(subset=["POSITION_EN"])
)

result

         POSITION_EN  ORDER_DATE
3185  Branch Manager  2024-09-09

Geef een overzicht met daarin de verschillende namen van producten en bijbehorende namen van producttypen van de producten waarvoor ooit meer dan 750 stuks tegelijk verkocht zijn. (2 kolommen, 9 rijen)

In [24]:
merge4 = pd.merge(order_details, products)
merge5 = pd.merge(merge4, product_types)
merge5Filter = merge5['QUANTITY'] > 750
merge5.loc[(merge5Filter), ['PRODUCT_NAME', 'PRODUCT_TYPE_EN']].drop_duplicates('PRODUCT_NAME')

                PRODUCT_NAME    PRODUCT_TYPE_EN
539        BugShield Extreme  Insect Repellents
1759                Star Peg              Tents
20121  BugShield Lotion Lite  Insect Repellents
20147         Sun Shelter 15          Sunscreen
20152         Sun Shelter 30          Sunscreen
31236        BugShield Spray  Insect Repellents
37272              Firefly 2           Lanterns
37348       BugShield Lotion  Insect Repellents
37363             Sun Shield          Sunscreen

Geef een overzicht met daarin de productnamen waarvan ooit meer dan 40% korting is verleend. De formule voor korting is: (unit_price - unit_sale_price) / unit_price (1 kolom, 8 rijen)

In [25]:
merge4Filter = ((merge4['UNIT_PRICE'] - merge4['UNIT_SALE_PRICE']) / merge4['UNIT_PRICE']) > 0.40
merge4.loc[(merge4Filter), ['PRODUCT_NAME']].drop_duplicates()

                      PRODUCT_NAME
506              BugShield Natural
511                BugShield Spray
650   Hailstorm Titanium Woods Set
2797         BugShield Lotion Lite
2836                Sun Shelter 30
3751             BugShield Extreme
5074                Sun Shelter 15
6930              BugShield Lotion

Geef een overzicht met daarin de retourreden van producten waarvan ooit meer dan 90% van de aangeschafte hoeveelheid is teruggebracht (return_quantity/quantity). (1 kolom, 3 rijen)

In [26]:
merge6 = pd.merge(returned_items, order_details)
merge6 = pd.merge(merge6, return_reasons)
merge6Filter = (merge6['RETURN_QUANTITY'] / merge6['QUANTITY']) > 0.9
merge6 = merge6.loc[(merge6Filter), :].drop_duplicates('PRODUCT_NUMBER').loc[:, ['RETURN_DESCRIPTION_EN']]
merge6.drop_duplicates()

    RETURN_DESCRIPTION_EN
0  Unsatisfactory product
2   Wrong product shipped
7   Wrong product ordered

## Selecties op meerdere tabellen met functies

Geef een overzicht met daarin per producttype het aantal producten die tot dat producttype behoren. (2 kolommen, 21 rijen)

In [27]:
merge7 = pd.merge(product_types, products, how='left')
merge7.groupby('PRODUCT_TYPE_EN')['PRODUCT_NUMBER'].count()

PRODUCT_TYPE_EN
Binoculars               4
Climbing Accessories     7
Cooking Gear            10
Eyewear                  5
First Aid                5
Golf Accessories         4
Insect Repellents        5
Irons                    4
Knives                   5
Lanterns                12
Navigation               4
Packs                    6
Putters                  3
Rope                     4
Safety                   4
Sleeping Bags            7
Sunscreen                5
Tents                    6
Tools                    6
Watches                  5
Woods                    4
Name: PRODUCT_NUMBER, dtype: int64

Geef een overzicht met daarin per land het aantal vestigingen van klanten die zich in dat land bevinden. (2 kolommen, 21 rijen)

In [28]:
merge8 = pd.merge(countries, retailer_sites, how='left')
merge8.groupby('COUNTRY')['RETAILER_CODE'].count()

COUNTRY
Australia          10
Austria            10
Belgium            10
Brazil              1
Canada             31
China              10
Denmark             6
Finland             5
France             29
Germany            32
Italy              12
Japan              25
Korea              10
Mexico             10
Netherlands        20
Spain               9
Sweden             12
Switzerland        13
Taiwan             10
United Kingdom     25
United States     101
Name: RETAILER_CODE, dtype: int64

Geef een overzicht met daarin van de producten behorend tot het producttype ‘Cooking Gear’ per productnaam de totaal verkochte hoeveelheid en de gemiddelde verkoopprijs. Sorteer de uitkomst op totaal verkochte hoeveelheid. (6 kolommen, 10 rijen)

In [29]:
merge9 = pd.merge(product_types, pd.merge(pd.merge(order_details, order_headers), products), how='left')
merge9Filter = merge9['PRODUCT_TYPE_EN'] == 'Cooking Gear'

merge9 = merge9.loc[(merge9Filter), ['PRODUCT_NAME', 'QUANTITY', 'UNIT_SALE_PRICE']].groupby('PRODUCT_NAME').agg({'QUANTITY': 'sum', 'UNIT_SALE_PRICE': 'mean' })
merge9.sort_values('QUANTITY')

                           QUANTITY  UNIT_SALE_PRICE
PRODUCT_NAME
TrailChef Deluxe Cook Set      3110       121.217638
TrailChef Single Flame         8504        63.827622
TrailChef Kettle               8826        12.201235
TrailChef Cook Set            10878        51.687926
TrailChef Double Flame        12476       132.672882
TrailChef Utensils            13776        17.294151
TrailChef Kitchen Kit         22206        22.345975
TrailChef Canteen             26544        11.979418
TrailChef Cup                 27418         6.976490
TrailChef Water Bag           36738         6.032506

Geef een overzicht met daarin per land de naam van het land, de naam van de stad waar de verkoopafdeling is gevestigd (noem de kolomnaam in het overzicht ‘verkoper’) en het aantal steden waar zich klanten bevinden in dat land (noem de kolomnaam in het overzicht ‘klanten’) (3 kolommen, 29 rijen)

In [30]:
merge10 = pd.merge(sales_branches, countries)
merge10 = pd.merge(merge10, retailer_sites, on='COUNTRY_CODE')
merge10 = merge10.rename(columns={'CITY_x': 'verkoper', 'RETAILER_SITE_CODE': 'klanten'})
merge10Temp = merge10.groupby('verkoper').agg({'COUNTRY': 'first', 'klanten': 'count'})
merge10Temp

                         COUNTRY  klanten
verkoper
Amsterdam            Netherlands       20
Bilbao                     Spain        9
Birmingham        United Kingdom       25
Boston             United States      101
Calgary                   Canada       31
Distrito Federal          Mexico       10
Hamburg                  Germany       32
Heverlee                 Belgium       10
Kista                     Sweden       12
Kuopio                   Finland        5
London            United Kingdom       25
Los Angeles        United States      101
Lyon                      France       29
Melbourne              Australia       10
Miami              United States      101
Milano                     Italy       12
München                  Germany       32
Osaka City                 Japan       25
Paris                     France       29
San Chung                 Taiwan       10
Seattle            United States      101
Seoul                      Korea       10
Shanghai                   China       10
São Paulo                 Brazil        1
Tokyo                      Japan       25
Toronto                   Canada       31
Wien                     Austria       10
Zürich               Switzerland       13

## Pythonvertalingen van SUBSELECT en UNION met o.a. for-loops

Geef een overzicht met daarin de voornaam en de achternaam van de medewerkers die nog nooit wat hebben verkocht (2 kolommen, 25 rijen)

In [31]:
merger1 = pd.merge(sales_staffs, order_headers, how='left')
merger1.loc[(merger1['ORDER_NUMBER'].isna()), ['FIRST_NAME', 'LAST_NAME']]

     FIRST_NAME      LAST_NAME
0         Denis           Pagé
320        Else         Mörike
321       Frank          Fuchs
647       Fritz         Hirsch
648        Jörg          Kunze
728       Maria      Iacobucci
946        Kick        Kalkman
1309      Karin      Bergström
1395      Sally          White
1421      Frank        Bretton
1422    Georges  Saint-Germain
1719       Alex      Rodriguez
2088   Samantha          Floyd
2392      Julie          Olsen
2530      Corey         Wright
2873    Estelle        Johnson
2874       Greg        Belding
2999      Julie        Béchard
3157      Lucía          Reyna
3401     Kazumi        Uragome
3559      Alice         Walter
4185     Walter         Taylor
4186   Penelope        Tamrine
4349      Polly         Linton
4590      Gracy        Gellens

Geef een overzicht met daarin het aantal producten waarvan de marge lager is dan de gemiddelde marge van alle producten samen. Geef in het overzicht tevens aan wat de gemiddelde marge is van dit aantal producten waarvan de marge lager dan de gemiddelde marge van alle producten samen is. (1 kolom, 2 rijen)

In [35]:
pd.DataFrame({
    "overzicht": [(products["MARGIN"] < products["MARGIN"].mean()).sum(),
        products.loc[products["MARGIN"] < products["MARGIN"].mean(), "MARGIN"].mean()
    ]
})

   overzicht
0  59.000000
1   0.292203

Geef een overzicht met daarin de namen van de producten die voor meer dan 500 (verkoopprijs) zijn verkocht maar nooit zijn teruggebracht. (1 kolom, 13 rijen)

In [33]:
merger3 = pd.merge(pd.merge(order_details, returned_items, how='left'), products, how='left')
merger3Filter = merger3['UNIT_SALE_PRICE'] > 500
merger3.loc[(merger3['RETURN_CODE'].isna()), :].loc[(merger3Filter), ['PRODUCT_NAME']].drop_duplicates().reset_index(drop=True) #dit ziet er mss heel lelijk en kan vast heel veel beter maar heb daar totaal gen zin meer in

                         PRODUCT_NAME
0                           Star Dome
1                        Star Gazer 2
2                        Star Gazer 3
3                        Star Gazer 6
4               Hailstorm Steel Irons
5            Hailstorm Titanium Irons
6          Lady Hailstorm Steel Irons
7       Lady Hailstorm Titanium Irons
8        Hailstorm Titanium Woods Set
9           Hailstorm Steel Woods Set
10  Lady Hailstorm Titanium Woods Set
11     Lady Hailstorm Steel Woods Set
12                     Husky Rope 200

Geef een overzicht met daarin per (achternaam van) medewerker of hij/zij manager is of niet, door deze informatie toe te voegen als extra 'Ja/Nee'-kolom.<br>
Hint: gebruik een for-loop waarin je o.a. bepaalt of het woord 'Manager' in de functie (position_en) staat. (2 kolommen, 102 rijen).

In [36]:
sales_staffs.assign(Manager=np.where(sales_staffs["POSITION_EN"].str.contains("Manager"), "Ja", "Nee"))[["LAST_NAME", "Manager"]]

     LAST_NAME Manager
0         Pagé      Ja
1       Michel     Nee
2     Clermont     Nee
3       Jauvin     Nee
4    Wiesinger     Nee
..         ...     ...
97    Laermans     Nee
98     De Crée     Nee
99     Lattrez     Nee
100  Seefelder     Nee
101     Grüner     Nee

[102 rows x 2 columns]

Met de onderstaande code laat je Python het huidige jaar uitrekenen.

In [38]:
from datetime import date
date.today().year

2026

Met de onderstaande code selecteer je op een bepaald jaartal uit een datum.

In [39]:
from datetime import datetime

date_str = '16-8-2013'
date_format = '%d-%m-%Y'
date_obj = datetime.strptime(date_str, date_format)

date_obj.year

2013

Geef met behulp van bovenstaande hulpcode een overzicht met daarin op basis van het aantal jaar dat iemand in dienst is of een medewerker ‘kort in dienst’ (minder dan 30 jaar in dienst) of een ‘lang in dienst’ (groter dan gelijk aan 30 jaar in dienst) is. Geef daarbij per medewerker in een aparte kolom zowel ‘kort in dienst’ als ‘lang in dienst’ aan. Gebruik (wederom) een for-loop.<br>
(2 kolommen, 102 rijen)

In [42]:
sales_staffs.assign(
    Dienst=np.where((pd.to_datetime(date.today()) - pd.to_datetime(sales_staffs["DATE_HIRED"]))
        .dt.days >= 30*365.25 ,"lang in dienst", "kort in dienst"))[["FIRST_NAME", "Dienst"]]

    FIRST_NAME          Dienst
0        Denis  kort in dienst
1    Élizabeth  lang in dienst
2        Émile  kort in dienst
3      Étienne  kort in dienst
4      Elsbeth  kort in dienst
..         ...             ...
97       Giele  kort in dienst
98    François  kort in dienst
99      Yvette  kort in dienst
100      Willi  kort in dienst
101     Sabine  kort in dienst

[102 rows x 2 columns]